src/logs/confiabilidade/cenario1/4%/ack-1/log--1-1000-6.out
Topic to send: test-topic
Topic to acks: -1
Records: 80000
Size:1000
449 records sent, 89,8 records/sec (0,09 MB/sec), 11,1 ms avg latency, 257,0 ms max latency.
414 records sent, 81,2 records/sec (0,08 MB/sec), 12,3 ms avg latency, 211,0 ms max latency.
539 records sent, 105,1 records/sec (0,10 MB/sec), 9,5 ms avg latency, 214,0 ms max latency.
433 records sent, 84,1 records/sec (0,08 MB/sec), 11,9 ms avg latency, 1529,0 ms max latency.
444 records sent, 87,3 records/sec (0,08 MB/sec), 11,4 ms avg latency, 643,0 ms max latency.
393 records sent, 70,2 records/sec (0,07 MB/sec), 14,2 ms avg latency, 626,0 ms max latency.
612 records sent, 122,4 records/sec (0,12 MB/sec), 8,1 ms avg latency, 646,0 ms max latency.
484 records sent, 95,4 records/sec (0,09 MB/sec), 10,5 ms avg latency, 621,0 ms max latency.
280 records sent, 55,0 records/sec (0,05 MB/sec), 18,2 ms avg latency, 210,0 ms max latency.
343 records sent, 67,7 records/sec (0,06 MB/sec), 14,7 ms avg latency, 622,0 ms max latency.
527 records sent, 105,4 records/sec (0,10 MB/sec), 9,5 ms avg latency, 649,0 ms max latency.
377 records sent, 73,5 records/sec (0,07 MB/sec), 13,6 ms avg latency, 619,0 ms max latency.
379 records sent, 74,2 records/sec (0,07 MB/sec), 13,5 ms avg latency, 225,0 ms max latency.
341 records sent, 67,7 records/sec (0,06 MB/sec), 14,8 ms avg latency, 648,0 ms max latency.
515 records sent, 100,5 records/sec (0,10 MB/sec), 9,9 ms avg latency, 618,0 ms max latency.
393 records sent, 76,8 records/sec (0,07 MB/sec), 13,0 ms avg latency, 634,0 ms max latency.
408 records sent, 79,6 records/sec (0,08 MB/sec), 12,6 ms avg latency, 210,0 ms max latency.
347 records sent, 68,5 records/sec (0,07 MB/sec), 14,6 ms avg latency, 644,0 ms max latency.
479 records sent, 94,5 records/sec (0,09 MB/sec), 10,6 ms avg latency, 214,0 ms max latency.
354 records sent, 70,4 records/sec (0,07 MB/sec), 14,2 ms avg latency, 622,0 ms max latency.
417 records sent, 81,1 records/sec (0,08 MB/sec), 12,3 ms avg latency, 210,0 ms max latency.
372 records sent, 73,7 records/sec (0,07 MB/sec), 13,6 ms avg latency, 622,0 ms max latency.
558 records sent, 107,3 records/sec (0,10 MB/sec), 9,3 ms avg latency, 210,0 ms max latency.
339 records sent, 67,8 records/sec (0,06 MB/sec), 14,7 ms avg latency, 642,0 ms max latency.
398 records sent, 75,1 records/sec (0,07 MB/sec), 13,3 ms avg latency, 622,0 ms max latency.
337 records sent, 67,3 records/sec (0,06 MB/sec), 14,8 ms avg latency, 648,0 ms max latency.
487 records sent, 95,5 records/sec (0,09 MB/sec), 10,5 ms avg latency, 634,0 ms max latency.
398 records sent, 78,1 records/sec (0,07 MB/sec), 12,8 ms avg latency, 625,0 ms max latency.
464 records sent, 92,4 records/sec (0,09 MB/sec), 10,8 ms avg latency, 632,0 ms max latency.
309 records sent, 60,2 records/sec (0,06 MB/sec), 16,6 ms avg latency, 620,0 ms max latency.
456 records sent, 87,7 records/sec (0,08 MB/sec), 11,4 ms avg latency, 210,0 ms max latency.
489 records sent, 96,4 records/sec (0,09 MB/sec), 10,4 ms avg latency, 228,0 ms max latency.
558 records sent, 111,6 records/sec (0,11 MB/sec), 8,9 ms avg latency, 642,0 ms max latency.
560 records sent, 111,9 records/sec (0,11 MB/sec), 8,9 ms avg latency, 210,0 ms max latency.
417 records sent, 83,4 records/sec (0,08 MB/sec), 12,0 ms avg latency, 648,0 ms max latency.
541 records sent, 104,8 records/sec (0,10 MB/sec), 9,5 ms avg latency, 631,0 ms max latency.
468 records sent, 92,1 records/sec (0,09 MB/sec), 10,9 ms avg latency, 644,0 ms max latency.
548 records sent, 109,6 records/sec (0,10 MB/sec), 9,1 ms avg latency, 213,0 ms max latency.
453 records sent, 90,5 records/sec (0,09 MB/sec), 11,0 ms avg latency, 210,0 ms max latency.
577 records sent, 114,4 records/sec (0,11 MB/sec), 8,7 ms avg latency, 210,0 ms max latency.
542 records sent, 104,8 records/sec (0,10 MB/sec), 9,5 ms avg latency, 210,0 ms max latency.
360 records sent, 71,1 records/sec (0,07 MB/sec), 14,1 ms avg latency, 210,0 ms max latency.
446 records sent, 85,9 records/sec (0,08 MB/sec), 11,6 ms avg latency, 210,0 ms max latency.
596 records sent, 117,0 records/sec (0,11 MB/sec), 8,5 ms avg latency, 210,0 ms max latency.
526 records sent, 102,5 records/sec (0,10 MB/sec), 9,7 ms avg latency, 631,0 ms max latency.
458 records sent, 90,9 records/sec (0,09 MB/sec), 11,0 ms avg latency, 642,0 ms max latency.
402 records sent, 78,5 records/sec (0,07 MB/sec), 12,7 ms avg latency, 628,0 ms max latency.
571 records sent, 113,6 records/sec (0,11 MB/sec), 8,8 ms avg latency, 641,0 ms max latency.
536 records sent, 103,7 records/sec (0,10 MB/sec), 9,6 ms avg latency, 210,0 ms max latency.
644 records sent, 125,6 records/sec (0,12 MB/sec), 7,9 ms avg latency, 210,0 ms max latency.
563 records sent, 112,5 records/sec (0,11 MB/sec), 8,9 ms avg latency, 210,0 ms max latency.
238 records sent, 43,6 records/sec (0,04 MB/sec), 22,9 ms avg latency, 649,0 ms max latency.
454 records sent, 90,3 records/sec (0,09 MB/sec), 11,1 ms avg latency, 621,0 ms max latency.
484 records sent, 95,5 records/sec (0,09 MB/sec), 10,5 ms avg latency, 628,0 ms max latency.
484 records sent, 95,3 records/sec (0,09 MB/sec), 10,5 ms avg latency, 210,0 ms max latency.
508 records sent, 99,5 records/sec (0,09 MB/sec), 10,0 ms avg latency, 216,0 ms max latency.
434 records sent, 86,8 records/sec (0,08 MB/sec), 11,5 ms avg latency, 210,0 ms max latency.
257 records sent, 50,6 records/sec (0,05 MB/sec), 19,8 ms avg latency, 651,0 ms max latency.
422 records sent, 81,8 records/sec (0,08 MB/sec), 12,2 ms avg latency, 628,0 ms max latency.
444 records sent, 88,8 records/sec (0,08 MB/sec), 11,2 ms avg latency, 627,0 ms max latency.
516 records sent, 100,6 records/sec (0,10 MB/sec), 9,9 ms avg latency, 645,0 ms max latency.
547 records sent, 105,7 records/sec (0,10 MB/sec), 9,5 ms avg latency, 210,0 ms max latency.
271 records sent, 49,4 records/sec (0,05 MB/sec), 20,2 ms avg latency, 644,0 ms max latency.
447 records sent, 86,6 records/sec (0,08 MB/sec), 11,5 ms avg latency, 210,0 ms max latency.
461 records sent, 92,2 records/sec (0,09 MB/sec), 10,8 ms avg latency, 210,0 ms max latency.
621 records sent, 122,7 records/sec (0,12 MB/sec), 8,1 ms avg latency, 210,0 ms max latency.
500 records sent, 98,1 records/sec (0,09 MB/sec), 10,2 ms avg latency, 210,0 ms max latency.
416 records sent, 81,4 records/sec (0,08 MB/sec), 12,3 ms avg latency, 621,0 ms max latency.
523 records sent, 102,3 records/sec (0,10 MB/sec), 9,8 ms avg latency, 210,0 ms max latency.
557 records sent, 111,3 records/sec (0,11 MB/sec), 9,0 ms avg latency, 626,0 ms max latency.
526 records sent, 103,1 records/sec (0,10 MB/sec), 9,7 ms avg latency, 210,0 ms max latency.
341 records sent, 66,0 records/sec (0,06 MB/sec), 15,2 ms avg latency, 210,0 ms max latency.
475 records sent, 91,3 records/sec (0,09 MB/sec), 10,9 ms avg latency, 210,0 ms max latency.
475 records sent, 94,0 records/sec (0,09 MB/sec), 10,6 ms avg latency, 210,0 ms max latency.
339 records sent, 67,8 records/sec (0,06 MB/sec), 14,7 ms avg latency, 639,0 ms max latency.
493 records sent, 96,5 records/sec (0,09 MB/sec), 10,3 ms avg latency, 209,0 ms max latency.
542 records sent, 104,6 records/sec (0,10 MB/sec), 9,6 ms avg latency, 210,0 ms max latency.
534 records sent, 103,6 records/sec (0,10 MB/sec), 9,6 ms avg latency, 638,0 ms max latency.
432 records sent, 83,4 records/sec (0,08 MB/sec), 12,0 ms avg latency, 630,0 ms max latency.
563 records sent, 112,6 records/sec (0,11 MB/sec), 8,9 ms avg latency, 209,0 ms max latency.
326 records sent, 65,2 records/sec (0,06 MB/sec), 15,3 ms avg latency, 650,0 ms max latency.
423 records sent, 84,6 records/sec (0,08 MB/sec), 11,8 ms avg latency, 624,0 ms max latency.
514 records sent, 99,8 records/sec (0,10 MB/sec), 10,0 ms avg latency, 210,0 ms max latency.
519 records sent, 101,0 records/sec (0,10 MB/sec), 9,9 ms avg latency, 209,0 ms max latency.
497 records sent, 97,5 records/sec (0,09 MB/sec), 10,3 ms avg latency, 646,0 ms max latency.
556 records sent, 111,2 records/sec (0,11 MB/sec), 9,0 ms avg latency, 210,0 ms max latency.
441 records sent, 81,8 records/sec (0,08 MB/sec), 12,2 ms avg latency, 627,0 ms max latency.
427 records sent, 79,4 records/sec (0,08 MB/sec), 12,6 ms avg latency, 627,0 ms max latency.
539 records sent, 107,8 records/sec (0,10 MB/sec), 9,3 ms avg latency, 221,0 ms max latency.
383 records sent, 75,6 records/sec (0,07 MB/sec), 13,2 ms avg latency, 619,0 ms max latency.
577 records sent, 115,4 records/sec (0,11 MB/sec), 8,7 ms avg latency, 210,0 ms max latency.
471 records sent, 93,7 records/sec (0,09 MB/sec), 10,7 ms avg latency, 214,0 ms max latency.
389 records sent, 76,4 records/sec (0,07 MB/sec), 13,1 ms avg latency, 642,0 ms max latency.
541 records sent, 105,0 records/sec (0,10 MB/sec), 9,5 ms avg latency, 210,0 ms max latency.
712 records sent, 140,9 records/sec (0,13 MB/sec), 7,1 ms avg latency, 210,0 ms max latency.
649 records sent, 126,0 records/sec (0,12 MB/sec), 7,9 ms avg latency, 644,0 ms max latency.
444 records sent, 88,8 records/sec (0,08 MB/sec), 11,2 ms avg latency, 642,0 ms max latency.
446 records sent, 89,2 records/sec (0,09 MB/sec), 11,2 ms avg latency, 239,0 ms max latency.
435 records sent, 87,0 records/sec (0,08 MB/sec), 11,5 ms avg latency, 212,0 ms max latency.
671 records sent, 133,6 records/sec (0,13 MB/sec), 7,5 ms avg latency, 210,0 ms max latency.
411 records sent, 79,3 records/sec (0,08 MB/sec), 12,6 ms avg latency, 644,0 ms max latency.
441 records sent, 87,9 records/sec (0,08 MB/sec), 11,4 ms avg latency, 650,0 ms max latency.
534 records sent, 103,7 records/sec (0,10 MB/sec), 9,6 ms avg latency, 210,0 ms max latency.
542 records sent, 104,6 records/sec (0,10 MB/sec), 9,6 ms avg latency, 633,0 ms max latency.
463 records sent, 92,5 records/sec (0,09 MB/sec), 10,8 ms avg latency, 210,0 ms max latency.
487 records sent, 96,3 records/sec (0,09 MB/sec), 10,4 ms avg latency, 213,0 ms max latency.
359 records sent, 71,0 records/sec (0,07 MB/sec), 14,1 ms avg latency, 1502,0 ms max latency.
433 records sent, 83,7 records/sec (0,08 MB/sec), 11,9 ms avg latency, 210,0 ms max latency.
359 records sent, 71,0 records/sec (0,07 MB/sec), 14,1 ms avg latency, 644,0 ms max latency.
614 records sent, 121,1 records/sec (0,12 MB/sec), 8,3 ms avg latency, 210,0 ms max latency.
517 records sent, 100,9 records/sec (0,10 MB/sec), 9,9 ms avg latency, 646,0 ms max latency.
505 records sent, 99,5 records/sec (0,09 MB/sec), 10,0 ms avg latency, 210,0 ms max latency.
387 records sent, 73,0 records/sec (0,07 MB/sec), 13,7 ms avg latency, 637,0 ms max latency.
438 records sent, 84,7 records/sec (0,08 MB/sec), 11,8 ms avg latency, 210,0 ms max latency.
429 records sent, 82,8 records/sec (0,08 MB/sec), 12,1 ms avg latency, 635,0 ms max latency.
455 records sent, 87,5 records/sec (0,08 MB/sec), 11,4 ms avg latency, 210,0 ms max latency.
328 records sent, 65,6 records/sec (0,06 MB/sec), 15,2 ms avg latency, 647,0 ms max latency.
346 records sent, 68,2 records/sec (0,07 MB/sec), 14,7 ms avg latency, 1523,0 ms max latency.
349 records sent, 69,4 records/sec (0,07 MB/sec), 14,4 ms avg latency, 643,0 ms max latency.
437 records sent, 87,4 records/sec (0,08 MB/sec), 11,4 ms avg latency, 643,0 ms max latency.
458 records sent, 91,6 records/sec (0,09 MB/sec), 10,9 ms avg latency, 210,0 ms max latency.
502 records sent, 98,7 records/sec (0,09 MB/sec), 10,1 ms avg latency, 635,0 ms max latency.
439 records sent, 87,8 records/sec (0,08 MB/sec), 11,4 ms avg latency, 634,0 ms max latency.
509 records sent, 100,3 records/sec (0,10 MB/sec), 9,9 ms avg latency, 210,0 ms max latency.
458 records sent, 88,2 records/sec (0,08 MB/sec), 11,3 ms avg latency, 623,0 ms max latency.
500 records sent, 98,1 records/sec (0,09 MB/sec), 10,2 ms avg latency, 639,0 ms max latency.
397 records sent, 78,0 records/sec (0,07 MB/sec), 12,8 ms avg latency, 210,0 ms max latency.
452 records sent, 83,1 records/sec (0,08 MB/sec), 12,0 ms avg latency, 653,0 ms max latency.
391 records sent, 72,8 records/sec (0,07 MB/sec), 13,7 ms avg latency, 1534,0 ms max latency.
602 records sent, 118,4 records/sec (0,11 MB/sec), 8,4 ms avg latency, 628,0 ms max latency.
694 records sent, 137,9 records/sec (0,13 MB/sec), 7,2 ms avg latency, 234,0 ms max latency.
472 records sent, 94,4 records/sec (0,09 MB/sec), 10,6 ms avg latency, 210,0 ms max latency.
465 records sent, 88,7 records/sec (0,08 MB/sec), 11,3 ms avg latency, 648,0 ms max latency.
386 records sent, 76,5 records/sec (0,07 MB/sec), 13,1 ms avg latency, 210,0 ms max latency.
635 records sent, 123,7 records/sec (0,12 MB/sec), 8,1 ms avg latency, 218,0 ms max latency.
465 records sent, 92,9 records/sec (0,09 MB/sec), 10,7 ms avg latency, 213,0 ms max latency.
422 records sent, 82,0 records/sec (0,08 MB/sec), 12,2 ms avg latency, 210,0 ms max latency.
570 records sent, 114,0 records/sec (0,11 MB/sec), 8,8 ms avg latency, 210,0 ms max latency.
422 records sent, 84,4 records/sec (0,08 MB/sec), 11,8 ms avg latency, 1528,0 ms max latency.
579 records sent, 115,8 records/sec (0,11 MB/sec), 8,6 ms avg latency, 210,0 ms max latency.
572 records sent, 110,2 records/sec (0,11 MB/sec), 9,1 ms avg latency, 210,0 ms max latency.
417 records sent, 81,4 records/sec (0,08 MB/sec), 12,3 ms avg latency, 210,0 ms max latency.
488 records sent, 96,4 records/sec (0,09 MB/sec), 10,4 ms avg latency, 627,0 ms max latency.
365 records sent, 71,5 records/sec (0,07 MB/sec), 14,0 ms avg latency, 644,0 ms max latency.
607 records sent, 119,7 records/sec (0,11 MB/sec), 8,3 ms avg latency, 234,0 ms max latency.
564 records sent, 108,9 records/sec (0,10 MB/sec), 9,2 ms avg latency, 622,0 ms max latency.
437 records sent, 83,9 records/sec (0,08 MB/sec), 11,9 ms avg latency, 646,0 ms max latency.
363 records sent, 72,5 records/sec (0,07 MB/sec), 13,8 ms avg latency, 627,0 ms max latency.
357 records sent, 71,0 records/sec (0,07 MB/sec), 14,1 ms avg latency, 624,0 ms max latency.
467 records sent, 93,0 records/sec (0,09 MB/sec), 10,7 ms avg latency, 210,0 ms max latency.
404 records sent, 79,3 records/sec (0,08 MB/sec), 12,6 ms avg latency, 627,0 ms max latency.
534 records sent, 103,7 records/sec (0,10 MB/sec), 9,6 ms avg latency, 1697,0 ms max latency.
403 records sent, 79,1 records/sec (0,08 MB/sec), 12,6 ms avg latency, 631,0 ms max latency.
486 records sent, 96,6 records/sec (0,09 MB/sec), 10,3 ms avg latency, 626,0 ms max latency.
510 records sent, 100,0 records/sec (0,10 MB/sec), 10,0 ms avg latency, 639,0 ms max latency.
510 records sent, 100,8 records/sec (0,10 MB/sec), 9,9 ms avg latency, 209,0 ms max latency.
591 records sent, 117,3 records/sec (0,11 MB/sec), 8,5 ms avg latency, 210,0 ms max latency.
484 records sent, 95,7 records/sec (0,09 MB/sec), 10,4 ms avg latency, 632,0 ms max latency.
391 records sent, 77,0 records/sec (0,07 MB/sec), 13,0 ms avg latency, 622,0 ms max latency.
350 records sent, 70,0 records/sec (0,07 MB/sec), 14,3 ms avg latency, 635,0 ms max latency.
406 records sent, 79,4 records/sec (0,08 MB/sec), 12,6 ms avg latency, 632,0 ms max latency.
382 records sent, 75,8 records/sec (0,07 MB/sec), 13,2 ms avg latency, 630,0 ms max latency.
453 records sent, 90,6 records/sec (0,09 MB/sec), 11,0 ms avg latency, 645,0 ms max latency.
530 records sent, 104,0 records/sec (0,10 MB/sec), 9,6 ms avg latency, 210,0 ms max latency.
580 records sent, 115,6 records/sec (0,11 MB/sec), 8,6 ms avg latency, 210,0 ms max latency.
453 records sent, 90,5 records/sec (0,09 MB/sec), 11,0 ms avg latency, 630,0 ms max latency.
440 records sent, 87,7 records/sec (0,08 MB/sec), 11,4 ms avg latency, 639,0 ms max latency.
620 records sent, 122,1 records/sec (0,12 MB/sec), 8,2 ms avg latency, 210,0 ms max latency.
494 records sent, 80,2 records/sec (0,08 MB/sec), 12,5 ms avg latency, 1537,0 ms max latency.
371 records sent, 73,5 records/sec (0,07 MB/sec), 13,6 ms avg latency, 643,0 ms max latency.
371 records sent, 73,3 records/sec (0,07 MB/sec), 13,6 ms avg latency, 642,0 ms max latency.
80000 records sent, 91,188043 records/sec (0,09 MB/sec), 10,95 ms avg latency, 1697,00 ms max latency, 2 ms 50th, 3 ms 95th, 209 ms 99th, 628 ms 99.9th.

Metric Name                                                                          Value
app-info:commit-id:{client-id=producer-1}                                          : d4284cbebb6f0a4c
app-info:start-time-ms:{client-id=producer-1}                                      : 1592627785147
app-info:version:{client-id=producer-1}                                            : 2.3.1
kafka-metrics-count:count:{client-id=producer-1}                                   : 126,000
producer-metrics:batch-size-avg:{client-id=producer-1}                             : 1075,000
producer-metrics:batch-size-max:{client-id=producer-1}                             : 1075,000
producer-metrics:batch-split-rate:{client-id=producer-1}                           : 0,000
producer-metrics:batch-split-total:{client-id=producer-1}                          : 0,000
producer-metrics:buffer-available-bytes:{client-id=producer-1}                     : 33554432,000
producer-metrics:buffer-exhausted-rate:{client-id=producer-1}                      : 0,000
producer-metrics:buffer-exhausted-total:{client-id=producer-1}                     : 0,000
producer-metrics:buffer-total-bytes:{client-id=producer-1}                         : 33554432,000
producer-metrics:bufferpool-wait-ratio:{client-id=producer-1}                      : 0,000
producer-metrics:bufferpool-wait-time-total:{client-id=producer-1}                 : 0,000
producer-metrics:compression-rate-avg:{client-id=producer-1}                       : 1,000
producer-metrics:connection-close-rate:{client-id=producer-1}                      : 0,022
producer-metrics:connection-close-total:{client-id=producer-1}                     : 8,000
producer-metrics:connection-count:{client-id=producer-1}                           : 3,000
producer-metrics:connection-creation-rate:{client-id=producer-1}                   : 0,022
producer-metrics:connection-creation-total:{client-id=producer-1}                  : 11,000
producer-metrics:failed-authentication-rate:{client-id=producer-1}                 : 0,000
producer-metrics:failed-authentication-total:{client-id=producer-1}                : 0,000
producer-metrics:failed-reauthentication-rate:{client-id=producer-1}               : 0,000
producer-metrics:failed-reauthentication-total:{client-id=producer-1}              : 0,000
producer-metrics:incoming-byte-rate:{client-id=producer-1}                         : 5444,701
producer-metrics:incoming-byte-total:{client-id=producer-1}                        : 4966084,000
producer-metrics:io-ratio:{client-id=producer-1}                                   : 0,003
producer-metrics:io-time-ns-avg:{client-id=producer-1}                             : 11580,833
producer-metrics:io-wait-ratio:{client-id=producer-1}                              : 0,991
producer-metrics:io-wait-time-ns-avg:{client-id=producer-1}                        : 3810431,933
producer-metrics:io-waittime-total:{client-id=producer-1}                          : 868660306520,000
producer-metrics:iotime-total:{client-id=producer-1}                               : 3056820845,000
producer-metrics:metadata-age:{client-id=producer-1}                               : 14,853
producer-metrics:network-io-rate:{client-id=producer-1}                            : 175,207
producer-metrics:network-io-total:{client-id=producer-1}                           : 160049,000
producer-metrics:outgoing-byte-rate:{client-id=producer-1}                         : 100258,898
producer-metrics:outgoing-byte-total:{client-id=producer-1}                        : 91597598,000
producer-metrics:produce-throttle-time-avg:{client-id=producer-1}                  : 0,000
producer-metrics:produce-throttle-time-max:{client-id=producer-1}                  : 0,000
producer-metrics:reauthentication-latency-avg:{client-id=producer-1}               : NaN
producer-metrics:reauthentication-latency-max:{client-id=producer-1}               : NaN
producer-metrics:record-error-rate:{client-id=producer-1}                          : 0,000
producer-metrics:record-error-total:{client-id=producer-1}                         : 0,000
producer-metrics:record-queue-time-avg:{client-id=producer-1}                      : 0,532
producer-metrics:record-queue-time-max:{client-id=producer-1}                      : 1535,000
producer-metrics:record-retry-rate:{client-id=producer-1}                          : 0,022
producer-metrics:record-retry-total:{client-id=producer-1}                         : 7,000
producer-metrics:record-send-rate:{client-id=producer-1}                           : 87,551
producer-metrics:record-send-total:{client-id=producer-1}                          : 80007,000
producer-metrics:record-size-avg:{client-id=producer-1}                            : 1091,000
producer-metrics:record-size-max:{client-id=producer-1}                            : 1091,000
producer-metrics:records-per-request-avg:{client-id=producer-1}                    : 1,000
producer-metrics:request-latency-avg:{client-id=producer-1}                        : 10,922
producer-metrics:request-latency-max:{client-id=producer-1}                        : 643,000
producer-metrics:request-rate:{client-id=producer-1}                               : 87,608
producer-metrics:request-size-avg:{client-id=producer-1}                           : 1144,267
producer-metrics:request-size-max:{client-id=producer-1}                           : 1145,000
producer-metrics:request-total:{client-id=producer-1}                              : 80028,000
producer-metrics:requests-in-flight:{client-id=producer-1}                         : 0,000
producer-metrics:response-rate:{client-id=producer-1}                              : 87,606
producer-metrics:response-total:{client-id=producer-1}                             : 80021,000
producer-metrics:select-rate:{client-id=producer-1}                                : 260,052
producer-metrics:select-total:{client-id=producer-1}                               : 239882,000
producer-metrics:successful-authentication-no-reauth-total:{client-id=producer-1}  : 0,000
producer-metrics:successful-authentication-rate:{client-id=producer-1}             : 0,000
producer-metrics:successful-authentication-total:{client-id=producer-1}            : 0,000
producer-metrics:successful-reauthentication-rate:{client-id=producer-1}           : 0,000
producer-metrics:successful-reauthentication-total:{client-id=producer-1}          : 0,000
producer-metrics:waiting-threads:{client-id=producer-1}                            : 0,000
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node--3}   : 0,000
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node-1}    : 1881,311
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node-3}    : 1787,821
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node-6}    : 1803,207
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node--3}  : 579,000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node-1}   : 1661105,000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node-3}   : 1647874,000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node-6}   : 1656526,000
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node--3}   : 0,000
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node-1}    : 34760,488
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node-3}    : 33142,671
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node-6}    : 34106,818
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node--3}  : 67,000
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node-1}   : 30643451,000
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node-3}   : 30394107,000
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node-6}   : 30559973,000
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node--3}  : NaN
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node-1}   : 9,994
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node-3}   : 10,204
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node-6}   : 12,366
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node--3}  : NaN
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node-1}   : 631,000
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node-3}   : 643,000
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node-6}   : 639,000
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node--3}         : 0,000
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node-1}          : 30,358
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node-3}          : 28,972
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node-6}          : 29,816
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node--3}     : NaN
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node-1}      : 1145,000
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node-3}      : 1143,901
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node-6}      : 1143,853
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node--3}     : NaN
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node-1}      : 1145,000
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node-3}      : 1145,000
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node-6}      : 1145,000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node--3}        : 2,000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node-1}         : 26772,000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node-3}         : 26555,000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node-6}         : 26699,000
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node--3}        : 0,000
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node-1}         : 30,344
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node-3}         : 28,731
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node-6}         : 28,976
producer-node-metrics:response-total:{client-id=producer-1, node-id=node--3}       : 2,000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node-1}        : 26770,000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node-3}        : 26553,000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node-6}        : 26696,000
producer-topic-metrics:byte-rate:{client-id=producer-1, topic=test-topic}          : 94114,121
producer-topic-metrics:byte-total:{client-id=producer-1, topic=test-topic}         : 85996414,000
producer-topic-metrics:compression-rate:{client-id=producer-1, topic=test-topic}   : 1,000
producer-topic-metrics:record-error-rate:{client-id=producer-1, topic=test-topic}  : 0,000
producer-topic-metrics:record-error-total:{client-id=producer-1, topic=test-topic} : 0,000
producer-topic-metrics:record-retry-rate:{client-id=producer-1, topic=test-topic}  : 0,022
producer-topic-metrics:record-retry-total:{client-id=producer-1, topic=test-topic} : 7,000
producer-topic-metrics:record-send-rate:{client-id=producer-1, topic=test-topic}   : 87,551
producer-topic-metrics:record-send-total:{client-id=producer-1, topic=test-topic}  : 80007,000
Produce Time: 877.308
Aplication time: 877.985
*****Produção finalizada, esperando 180 s para buscar WM*****
Water mark: 560000